app/controllers/datos_controller.rb

SELECT "datos".* FROM "datos"
---
  def index
    @datos = Dato.all

INSERT INTO "datos" ("nombre", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "Ejemplo"], ["descripcion", "Esto es un ejemplo"], ["created_at", "2023-08-31 17:16:38.822382"], ["updated_at", "2023-08-31 17:16:38.822382"]]
---
  def create
    @dato = Dato.new(dato_params)

    if @dato.save

UPDATE "datos" SET "nombre" = $1, "descripcion" = $2, "updated_at" = $3 WHERE "datos"."id" = $4  [["nombre", "Test3"], ["descripcion", "Actualizacion de dato"], ["updated_at", "2023-08-31 17:29:50.638606"], ["id", 5]]
---
  def update
    if @dato.update(dato_params)

SELECT "datos".* FROM "datos" WHERE "datos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_dato
    @dato = Dato.find(params[:id])